# SheetMass Property (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
FabricSheetType..::..SheetMass Property
FabricSheetType Class See Also
---
The sheet mass.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double SheetMass { get; set; }
```

Visual Basic
---
```text
Public Property SheetMass As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double SheetMass {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: The given value for sheetMass is not a number |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: The given value for sheetMass must be non-negative. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | When setting this property: None of the following disciplines is enabled: Structural. |

# See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace